In [31]:
import pandas as pd
df = pd.DataFrame({
    'name': ['Mike','Alice','Bob'],
    'age': [30,45,80],
    'job': ['Programmer','Designer','Accountant']
    }
)
df = df.set_index('name')

In [32]:
df.loc['Salohiddin'] =[19,'ML engineer']

In [33]:
def my_function(x):
    if x%3==0:
        return x**2
    else:
        return x//2

In [34]:
df.age.apply(my_function)

name
Mike           900
Alice         2025
Bob             40
Salohiddin       9
Name: age, dtype: int64

In [35]:
def my_function2(x):
    if x.endswith('r'):
        return 'Wuthout job'
    else:
        return 'has a job'

In [36]:
df.job.apply(my_function2)

name
Mike          Wuthout job
Alice         Wuthout job
Bob             has a job
Salohiddin    Wuthout job
Name: job, dtype: object

In [37]:
df.age.apply(my_function)

name
Mike           900
Alice         2025
Bob             40
Salohiddin       9
Name: age, dtype: int64

In [38]:
df.job.apply(my_function2)

name
Mike          Wuthout job
Alice         Wuthout job
Bob             has a job
Salohiddin    Wuthout job
Name: job, dtype: object

In [44]:

df.drop('summary', axis=1)

            age          job
name
Mike         30   Programmer
Alice        45     Designer
Bob          80   Accountant
Salohiddin   19  ML engineer

In [48]:
df.drop(['age','job'], axis = 1 )

                                summary
name
Mike        Age ['age'], Jobs: ['jobs']
Alice       Age ['age'], Jobs: ['jobs']
Bob         Age ['age'], Jobs: ['jobs']
Salohiddin  Age ['age'], Jobs: ['jobs']

In [ ]:
df.at['Alice','age']=float('nan')
df,